Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: མ་ག་དྷཱ་གཙོ་རྒྱལ་པོ་ཡང་། །སྐུ་སྦྱོང་ཤིང་གི་ཐད་འོངས་པ། །གླང་པོ་ཤིང་རྟ་བཞོན་རྟ་དང་། །མཐར་གྱིས་དེ་ནས་ཐེག་པ་ཡིས། །
en: “The Magadhan king Will approach the funeral pyre At the head of a procession of chariots Drawn by elephants and horses. {53.189}

source: དེ་ནས་དཔུང་ཆེན་ས་ཡི་བདག །ཀུན་ཀྱང་སྟོབས་དང་བཞོན་པར་བཅས། །དེ་ཚེ་ཐུབ་པ་ཤཱཀ་ཐུབ་ལ། །
en: “Then other kings, commanders of great forces, Will arrive there, all of them with their armies, To pay respects To the sage Śākyamuni, {53.190}

source: དེ་ནི་ཕྱག་འཚལ་དོན་དུ་ལྷགས། །ས་སྟེང་ཞི་བའི་གཟིམས་མལ་དུ། །བས་མཐའ་དགོན་པར་མྱ་ངན་འདས། །ཆུ་བོ་གསེར་ལྡན་འགྲམ་དང་ནི། །ཅོད་པན་བཅིངས་པའི་མཆོད་རྟེན་དུ། །ཞི་བའི་དབྱིངས་ལ་ཡང་དག་ཞུགས། །ཡང་དག་མཐའ་ལ་ཡོངས་སུ་བརྟེན། །
en: “Who passed into nirvāṇa lying on the ground, In a peaceful spot at the edge of the forest, On the bank of the Hiraṇyavatī, in Makuṭabandhana, And is now inside the caitya, Absorbed into the sphere of peace And abiding in ultimate reality. {53.191}

source: མ་ག་དྷཱ་ཡི་རྒྱལ་པོ་དེར། །དཔུང་ཆེན་ལྡན་པས་ཡང་དག་ལྷགས། །རྣམ་པ་སྣ་ཚོགས་སྤྱོད་པ་ཡིས། །དེ་ཡང་ང་ལ་སྟོད་པར་བྱེད། །
en: “The Magadhan king, Accompanied by his great army, Will see celestial displays Of many kinds, {53.192}

source: ཕན་ཡོན་ཆེ་ཞིང་སྟོབས་དང་ལྡན། །ངོ་མཚར་ས་ཡི་རྒྱན་གྱུར་པ། །ཐུབ་པའི་སྐུ་སྦྱངས་ལས་བྱུང་བའི། །དེར་ནི་སྐུ་གདུང་མཆོད་རྟེན་བྱས། །
en: “Rich in blessing, powerful, Miraculous, adorning the earth, Arising from the form of the caitya Where the Sage will be lying upon the pyre. {53.193}

source: དགེ་སློང་ཀུན་དགའ་བོ་ཞེས་བྱ། །སློབ་པ་ང་ཡི་བསྙེན་བཀུར་བ། །མི་ཡི་དམ་པ་མཉེས་གཤིན་པ། །ང་ལ་རྟག་ཏུ་ཡོངས་སུ་དད། །ཡིད་ནི་ཞུམ་ཞིང་མྱ་ངན་གདུངས། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །
en: “The monk called Ānanda, Who attends upon me as my good student, The most eminent person, Always dear to me and a cause of delight, Will become disheartened at that time And, tormented by anguish, {53.194}

source: དེ་ནས་འོད་སྲུང་ཐད་སོང་ནས། །རྐང་པ་གཉིས་ལ་རབ་བཏུད་ནས། །
en: “Will approach Mahākāśyapa And fall down at his feet.

source: སྡུག་བསྔལ་ཉམ་ཐག་འདར་བ་ཡིས། །འདི་སྐད་སྒྲ་ནི་འཛེར་བས་སྨྲས། །
en: Distressed, he will speak In a stammering and faltering voice: {53.195}

source: དེང་འདིར་ང་ཡི་སྟོན་པ་འདས། །ད་ལྟར་བདག་ནི་མགོན་མེད་གྱུར། །
en: “ ‘My teacher has passed into nirvāṇa today; Now I am without a protector.

source: ང་ཡི་རྟེན་དང་གནས་དང་སྐྱབས། །ཁྱོད་ཉིད་དུ་ནི་རབ་ཏུ་བསྟན། །
en: He indicated that you alone Will be my refuge and protection. {53.196}

source: ཐུབ་པའི་ཟླ་བ་དེ་ཉིད་ཀྱིས། །ཉེ་གནས་ཁྱོད་ཀྱི་ར་ལུང་ཡང་བསྟན། །
en: “ ‘The moon-like sage prophesied That I, continuing at your side,

source: ཉོན་མོངས་ཀུན་ནི་རྣམ་སྤངས་པ། །ཁྱོད་ཀྱི་ཉེ་གནས་དགྲ་བཅོམ་པ། །
en: Will remove all my afflictions And attain arhatship. {53.197}

source: ཐུན་གྱི་ཕྱི་མ་མཚན་མཐའ་ལ། །རྒྱལ་བ་དེས་ནི་བསྟན་པ་ཡིན། །ང་ཉིད་མྱ་ངན་འདས་པ་ན། །རྟག་ཏུ་ཁྱོད་ནི་ཡོད་པར་འགྱུར། །
en: “ ‘The Victorious One revealed During the last watch of the night That I am selected to be always with you Until I have passed into final nirvāṇa. {53.198}

source: སངས་རྒྱས་མཛད་པའི་དོན་དུ་ནི། །ཕན་པར་འདོད་པས་ཁྱོད་བྱེད་འགྱུར། །
en: “ ‘Desiring what is beneficial, he appointed you To carry out the work of the Buddha.

source: སྡུག་བསྔལ་ཅན་བདག་སྤངས་ནས་ཀྱང་། །ཐུབ་པ་ཆེན་པོ་ཞི་བར་གཤེགས། །
en: The great Sage has passed into the final peace, Leaving me behind in distress.’ {53.199}

source: བློ་ལྡན་མ་འགགས་པ་ཞེས་པས། །སྡོམ་ཆེན་དེ་ནི་དབུགས་འབྱིན་བྱེད། །
en: “The sagacious Aniruddha Will comfort the pious monk:

source: ཁྱོད་ནི་མྱ་ངན་དུ་མ་བྱེད། །མྱ་ངན་དག་ཀྱང་མ་བྱེད་ཅིག །
en: ‘Do not cry in distress! Do not fall into despair! {53.200}

source: གནས་ནི་གང་དུའང་འགྲོ་མ་བྱེད། །འདི་ཉིད་དུ་ནི་གནས་པར་གྱིས། །འཇིག་རྟེན་མིག་ནི་འདས་གྱུར་ནས། །འདི་ཉིད་སྟོན་པར་འགྱུར་བ་ཡིན། །
en: “ ‘Do not go to any other place, But stay here. Mahākāśyapa himself will be our teacher When the “eye of the world” is extinguished. {53.201}

source: འདིར་ནི་སྟོན་པས་ལུང་བསྟན་ནས། །སངས་རྒྱས་མཛད་པ་བྱེད་པར་འགྱུར། །
en: “ ‘It was prophesied here by the Sage That he will carry on the Buddha’s work,

source: ང་ཡང་བཅོམ་ལྡན་ལྷན་ཅིག་ཏུ། །འོད་སྲུང་རྗེས་སུ་འགྲོ་བར་བྱ། །
en: And we will follow him, Along with you. {53.202}

source: སྟོན་པ་གཉིས་པོ་དག་གི་ཡང་། །ས་ཡི་སྟེང་ན་གཟུགས་བརྙན་ཡིན། །རྫུ་འཕྲུལ་ཆེན་པོའི་ཉན་ཐོས་ནི། །འོད་སྲུང་ཆེན་པོ་གཙོ་བོ་ནི། །འཚོ་ཞིང་ཡོངས་སུ་གཞེས་པས་ན། །ཁྱོད་ནི་མྱ་ངན་མ་བྱེད་ཅིག །རྫུ་འཕྲུལ་ཆེན་པོ་སྙིང་རྗེས་ནོན། །རྣལ་འབྱོར་ཆེན་པོ་འདོད་ཆགས་བྲལ། །རྫུ་འཕྲུལ་ཆེན་པོ་ཐུབ་པའི་སྲས། །ཐམས་ཅད་དེ་བཞིན་སྨྲེ་བར་བྱེད། །
en: “ ‘As for his magical powers, Great distinction, energy, and great splendor, Mahākāśyapa is the second Teacher, as it were, His exact replica here on earth. {53.203} “ ‘For as long as Mahākāśyapa, This eminent śrāvaka of great power, Remains and holds fast, Do not fall into despair.’ {53.204} “Talking thus, all the sons of the Sage, Endowed with magical powers, Free from desire, and very studious, Will sit down. {53.205}

source: གྱད་དང་རྒྱལ་པོ་དག་གིས་ནི། །པུར་སྦྱོང་ཤིང་ལ་མེ་བཏང་བས། །འཁོར་ཡུག་ཀུན་ནས་མེ་འབར་ནས། །པུར་སྦྱོང་ཤིང་དེ་ཐལ་བར་གྱུར། །
en: “The pyre will be lit By the Malla kings. It will blaze on all sides And then change into ashes. {53.206}

source: དེ་མཐོང་ལྷ་ཡི་ཚོགས་དག་དང་། །གདེངས་ཅན་བྲང་འགྲོ་རྣམས་ཀྱིས་ནི། །པུར་སྦྱོང་ཤིང་གནས་ཞི་བའི་ཕྱིར། །ཙནྡན་ཆུ་ཡི་རྒྱུན་དག་གི། །ཆར་ཆེན་རབ་ཏུ་གཏོང་ཞིང་གནས། །དེ་ནས་དེ་ཡི་མོད་ལ་ཡང་། །ས་སྟེང་དུ་ཡང་དེ་བཞིན་དུ། །མེ་ཏོག་ཚོགས་ཀྱི་ཆར་ཡང་བཏང་། །
en: “Seeing this, the hosts of gods And the serpent-hooded mahoragas, In order to cool down the pyre ground, Will release a heavy shower {53.207} “Of sandalwood water, Followed by, the next instant, A great rain of flowers Released upon the earth. {53.208}

source: རྒྱལ་བའི་རིང་བསྲེལ་མཆོད་པའི་ཕྱིར། །དེ་ཡི་མོད་ལ་ཀུན་དེར་ལྷགས། །ཐམས་ཅད་ཕན་ཚུན་འཐབ་པའི་ཕྱིར། །དེ་ཡི་མོད་ལ་བྱ་བ་རྩོམ། །
en: “Instantly, all who came To worship the relics of the Victorious One Will all start fighting With each other. {53.209}

source: ཚངས་སོགས་བརྒྱ་བྱིན་འཐབ་བྲལ་དང་། །ལྷ་ཚོགས་ཀུན་ཀྱང་དེ་བཞིན་ནོ། །
en: “The Brahmās, the Śakras, the Yāmas, And all the hosts of gods

source: ཉན་ཐོས་ཆེན་པོ་འདོད་ཆགས་བྲལ། །རྫུ་འཕྲུལ་ཆེན་པོས་ཟློག་པར་བྱས། །
en: Will be held back by the śrāvakas With great magical powers. {53.210}

source: སྐུ་གདུང་རྒྱལ་བའི་རིང་བསྲེལ་ནི། །འོད་སྲུང་ཆེན་པོས་རྣམ་བགོས་པ། །
en: “Mahākāśyapa will distribute the relics Born from the body of the Victorious One.

source: མཆོད་པའི་དོན་དུ་ཐམས་ཅད་ལ། །ཅུང་ཟད་ཅུང་ཟད་ངེས་པར་བྱིན། །
en: He will give only a small portion to everyone, So that they may be worshiped,

source: ཐེག་པ་གསུམ་ལས་མི་ལྡོག་དང་། །ཞི་བ་མཐར་ཕྱིན་བྱ་ཕྱིར་རོ། །
en: Since they bring the final peace, The ultimate goal of the three vehicles. {53.211}

source: རྣལ་འབྱོར་དེ་ཚེ་འོད་སྲུང་ཆེ། །རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །
en: “Then Mahākāśyapa, a yogi Free from desire and very powerful,

source: རྒན་ཞུགས་ཀྱིས་ནི་སྨྲས་པའི་ཚིག །དེ་ནི་ཡོངས་སུ་སེམས་པར་བྱེད། །
en: Will reflect upon the memorable words Spoken by the unruly old monk, and say: {53.212}

source: འདིར་ནི་གསུང་རབ་མ་ལུས་པ། །ཡན་ལག་བཅུ་གཉིས་བདེ་འབྱུང་གནས། །མདོ་དང་འདུལ་བ་མངོན་པའི་ཆོས། །ནམ་མཁའི་དུད་བཞིན་མ་གྱུར་ཏམ། །
en: “ ‘The entirety of the great doctrine that brings happiness, With its twelve branches that comprise The Sūtra, the Vinaya, and the Abhidharma, Might vanish like smoke in the sky.

source: དཔའ་བོ་ཆེན་པོ་ནུབ་གྱུར་ནས། །བསྟན་པ་འཇིག་པར་འགྱུར་བས་ན། །
en: When the great hero has departed, The destruction of the doctrine will follow. {53.213}

source: སངས་རྒྱས་གསུང་བའི་བཀའ་འདི་ནི། །མ་ལུས་བདག་གིས་བསྡུ་བར་བྱ། །
en: “ ‘All the teachings spoken by the Buddha Should be collected together.

source: རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །མ་ལུས་ལྷན་ཅིག་བགྲོ་བར་བྱ། །
en: Let us all go together, Free from desire and dignified,

source: མ་ག་དྷཱ་ཡི་གྲོང་མཆོག་ཏུ། །གྲོང་ཁྱེར་བཟང་པོ་རྒྱལ་པོའི་ཁབ། །
en: To the capital city of the Magadhans, The fine city referred to as ‘royal’; {53.214}

source: ཀུ་ཤའི་གྲོང་ཁྱེར་ཉམས་དགའ་དང་། །རི་ནི་རྡོ་འཇོག་མཐོ་བ་དང་། །
en: “ ‘To beautiful Kuśāgrapura, With its nice, high mountains;

source: ཡུལ་བཟང་ཡངས་པ་ཅན་དང་ནི། །མཆོད་རྟེན་གནས་ནི་ལེགས་མཛེས་པ། །དེ་བཞིན་རྣམ་པ་དུ་མའི་གནས། །བསྟན་པ་བསྡུ་བའི་ཆེད་དག་ཏུ། །འདུས་ནས་སྨྲ་བ་ཀུན་སྨྲ་བ། །རྫུ་འཕྲུལ་ཆེན་པོ་བྱེད་པར་འགྱུར། །
en: And to Vaiśālī, a nice place Where there is a beautiful caitya.’ {53.215} “All the lamenting Mallas, Together with the dignified [śrāvakas], Will do many such [peregrinations] then For the sake of the teachings. {53.216}

source: ང་ཡང་འདིར་ནི་ནུབ་པ་དང་། །དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །ཕན་ཚུན་གསོད་པར་དགའ་བ་ཡི། །ས་བདག་རྣམས་ནི་འབྱུང་བར་འགྱུར། །
en: “At the end of the eon, When I have passed away, The kings will delight In killing one another. {53.217}

source: ལས་ཀྱི་མཐའ་མང་དགེ་སློང་རྣམས། །སེམས་ཅན་རྣམས་ནི་ཆགས་པས་རྨོངས། །
en: “Monks will engage in many types of business, And beings will be rendered senseless by greed.

source: དེ་བཞིན་དགེ་བསྙེན་དགེ་བསྙེན་མ། །དུས་ཀྱི་མཐའ་ལ་མ་ཞིར་འགྱུར། །
en: At the end of the eon, the male and female Lay practitioners will have no faith.

source: ཕན་ཚུན་སྐྱོན་ནི་འཚོལ་བྱེད་ཅིང་། །ཕན་ཚུན་གསོད་ལ་མངོན་པར་ཞེན། །
en: Dedicated to mutual slaughter, They will search each other out. {53.218}

source: རྨ་ལྡན་སྐྱོན་ནི་མ་རུངས་ལྟར། །སྐྱོན་ལ་རྟག་ཏུ་རྟོག་པར་བྱེད། །ཐུབ་པ་དེ་དུས་ནུབ་པ་ན། །དགེ་སློང་རྣམས་ནི་མ་བསྡམས་འགྱུར། །
en: “Armed with ‘piercing’ weapons, They will ever inflict wounds and bring harm. Monks will lack self-control At the end of the eon, when the Sage is gone. {53.219}

source: དེ་ཚེ་ས་སྟེང་བསྟན་པ་ནི། །བསྲུང་བའི་དོན་དུ་བཞག་གྱུར་པ། །ཆགས་བྲལ་ཟག་མེད་འཇིག་རྟེན་དུ། །རྫུ་འཕྲུལ་ཆེན་པོ་རྣམ་པ་བརྒྱད། །
en: “At that time, there will be on earth Eight arhats with great magical powers, Free from desire and karmic traits. They will be tasked with protecting my doctrine. {53.220}

source: དེ་ཚེ་དགྲ་བཅོམ་ཐུ་བོ་ཡང་། །སྒྲ་གཅན་འཛིན་སོགས་རབ་ཏུ་བསྒྲགས། །དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །དེ་དག་ཀྱང་ནི་སྣང་བ་མེད། །
en: “These distinguished arhats Will be those known as Rāhula and so forth. It will not be possible to see them At that time during the debased eon. {53.221}

source: སྔགས་པ་གྲུབ་པའི་དུས་སུ་ནི། །དེ་དག་མཐོང་བ་དོན་ཡོད་འགྱུར། །
en: “However, the practitioners of mantra, when accomplished, Will be able to see them without fail.

source: རྫུ་འཕྲུལ་ལྡན་ཞིང་རྫུ་འཕྲུལ་ཆེ། །ངས་ཀྱང་ཐམས་ཅད་བཞག་པ་ཡིན། །
en: All of them, appointed here by me, Will use the mantras of magic and possess great powers. {53.222}

source: གྲགས་པ་ཆེན་པོ་ཆད་པའི་ལས། །དེ་དག་ལ་ནི་ངས་བསྟན་པ། །དེ་དག་བཀའ་ལས་འདས་པ་འམ། །ཅུང་ཟད་བསླབ་ལས་རྣམ་འདས་ནའོ། །
en: “I have invested them, the glorious ones, With the authority to administer justice. Any student who disobeys their orders Will be guilty of transgression. {53.223}

source: ཇི་སྲིད་དམ་ཆོས་ཡང་དག་མཐའ། །ཟང་ཟིང་མེད་པར་གནས་པར་གྱིས། །
en: “If you hold on to the sacred Dharma— To the ultimate reality beyond the physical—

source: ང་ཡི་གསུང་གི་བསོད་ནམས་འདི། །ཇི་སྲིད་བསྟན་པ་སྟོབས་དང་ལྡན། །
en: And proclaim on earth This meritorious message of mine, {53.224}

source: དེས་ན་བདག་ཉིད་ཞིར་འགྱུར་ཞིང་། །ཟག་མེད་མྱ་ངན་འདའ་བར་འགྱུར། །
en: “Then you will obtain the peace of no-self And enter the final nirvāṇa without karmic traits.

source: དེ་ཚེ་ཐུབ་པའི་བསྟན་པ་ནི། །ཡོངས་སུ་ནུབ་པར་འགྱུར་བ་ན། །
en: When the Sage and his teaching have disappeared, The following will come to pass: {53.225}

source: དགེ་སློང་རྣམས་དང་དགེ་ཚུལ་རྣམས། །དགེ་སློང་མ་རྣམས་སེར་སྣར་བཅས། །
en: “The monks and nuns who live on alms Will all become very greedy.

source: རྟག་ཏུ་ངན་སྤྱོད་གཡོ་སྒྱུ་ཅན། །དེ་ཚེ་ཡོངས་སུ་མ་དག་པའོ། །
en: Ever acting as detestable beggars, They will proliferate during the debased eon. {53.226}

source: ང་ཡི་བསྟན་ལ་མི་གནས་ཤིང་། །ཁྱིམ་དང་ཆུང་མ་ཚོལ་བར་བྱེད། །
en: “The practice of keeping houses and wives Will become integrated into my doctrine.

source: དེ་ཡི་ཚེ་ན་དགེ་བསྙེན་རྣམས། །གཞན་གྱི་བུད་མེད་ལ་རྟག་དང་། །
en: Lay practitioners, at that time, Will always have sex with the wives of others. {53.227}

source: ལྷག་མ་རྣམ་པ་བཞི་པོ་ཉིད། །དེ་ཚེ་རྟགས་དང་མིང་ཙམ་ཡོད། །
en: “The fourfold assembly will remain In name only, merely to keep appearances.

source: འཁོན་འཛིན་ཐམས་ཅད་གོམས་བྱེད་ཅིང་། །གཅིག་ལ་གཅིག་ནི་རྣམ་འཚེ་བྱེད། །
en: They will all bring harm upon one another, Delighting in enmity. {53.228}

source: ཕལ་ཆེར་མུ་སྟེགས་ཀྱིས་ནོན་ཅིང་། །ལྷ་རྣམས་ཀུན་ཀྱང་གནོད་པར་འགྱུར། །
en: “The entire earth will be taken over By the tīrthikas and [saṃsāric] gods;

source: དེ་ཚེ་བྲམ་ཟེའི་རིགས་ལ་ནི། །སྐྱེ་བོ་རྣམས་ནི་དགའ་བར་འགྱུར། །
en: People, at that time, Will adore the brahmin caste. {53.229}

source: དེ་བཞིན་ལོག་སྤྱོད་རྨོངས་པ་དང་། །མི་རྣམས་སྲོག་ཆགས་འཚེ་བར་དགའ། །
en: “Deluded and following wrong conduct, They will delight in harming living beings.

source: ང་ནི་ཡོངས་སུ་མྱ་ངན་འདས། །རྩོད་དུས་འདི་ལ་ལུང་བསྟན་ཡིན། །
en: This has been prophesied for this lowest eon, When I enter into final nirvāṇa. {53.230}

source: མི་ནི་རྣམ་མང་གཞན་དག་ཀྱང་། །རྟག་ཏུ་གཞན་གྱི་བུད་མེད་དགའ། །
en: “Many men and women will Continuously indulge in adultery.

source: མི་དགེ་ཀུན་ལ་དགའ་བ་དང་། །དགེ་བའི་དོན་ནི་རྣམ་སྤངས་པ། །
en: They will all delight in nonvirtue And shun virtuous values. {53.231}

source: ང་ནི་ས་སྟེང་ཞིར་གཤེགས་ནས། །སེམས་ཅན་མང་པོ་འབྱུང་བར་འགྱུར། །ང་ཡི་སྐུ་ནི་མཆོད་པའི་ཕྱིར། །གཟི་བརྗིད་ཆེན་པོ་ལྷ་ཚོགས་དང་། །
en: “After I enter the final peace on earth, Many beings will be present, Worshiping my body, Such as the hosts of gods of great vitality and splendor, {53.232}

source: བདག་ཉིད་ཆེན་པོ་མི་རྣམས་དང་། །དེ་བཞིན་གནོད་སྦྱིན་འབྱུང་པོའི་ཚོགས། །ལྷ་མིན་དང་ནི་དྲི་ཟ་དང་། །རྫུ་འཕྲུལ་ཆེན་པོ་མི་འམ་ཅི། །དེ་ནས་མཁའ་ལྡིང་ཀླུ་དང་ནི། །དེ་བཞིན་སྲིན་པོ་དྲང་སྲོང་རྣམས། །རྣལ་འབྱོར་པ་དང་གྲུབ་པ་དང་། །གཟི་བརྗིད་ཆེན་པོ་གཟའ་རྣམས་དང་། །
en: “Men of distinction, Hosts of yakṣa s and spirits, Asuras, gandharvas, Kinnaras endowed with great powers, {53.233} “Garuḍas, nāga s, Rākṣasas, ṛṣis, Siddha s, yogins, Planets with great vitality, {53.234}

source: རྣམ་པ་སྣ་ཚོགས་སྐྱེ་གནས་དང་། །རྣམ་པ་སྣ་ཚོགས་སེམས་ཅན་རྣམས། །སྲིད་པའི་འཆིང་བས་བཅིངས་པ་དང་། །བློ་ལྡན་འཆིང་བ་བཅད་པ་དང་། །
en: “Beings of various types That take birth based on their different destinies And are caught in the chain of saṃsāric rebirths, And also the wise ones who have broken this chain. {53.235}

source: སྐུ་གདུང་ནད་བྲལ་འདི་ལ་ནི། །དེ་ཚེ་མཆོད་པ་བྱེད་པར་འགྱུར། །ཆུ་བོ་གསེར་ལྡན་འགྲམ་དང་ནི། །སཱ་ལ་ཟུང་གི་ཚལ་དང་ནི། །
en: “They will make offerings to my body, From which the pangs of fever have departed, On the bank of the Hiraṇyavatī, In the Yamakasāla Grove, {53.236}

source: ཅོད་པན་བཅིངས་པའི་མཆོད་རྟེན་དང་། །གྱད་རྣམས་ཀྱི་ནི་ཉེན་འཁོར་དུ། །
en: “In the Makuṭabandhana shrine, In the country of the Mallas.

source: ང་ནི་དེར་ཡང་མྱ་ངན་འདའ། །འཇིག་མེད་ཞི་བར་ཡོངས་སུ་འགྲོ། །
en: When I pass into final nirvāṇa there, I will attain the peace that is free from fear. {53.237}

source: ང་ཡི་སྐུ་གདུང་དེ་བླངས་ནས། །དེ་བཞིན་གཞན་གྱིས་འཕྲོག་པར་བྱེད། །ལྷ་དང་ལྷ་མ་ཡིན་རྣམས་དང་། །དེ་ཚེ་འབྱུང་པོའི་ཚོགས་ཀུན་གྱིས། །
en: “My relics will be exhumed, With some being stolen By gods, asuras, And all types of spirits.

source: སོ་སོར་ཆ་ནི་རྣམ་ཕྱེ་ནས། །རྣམ་པར་གཞག་པ་བྱས་པར་གྱུར། །
en: They will be divided into separate portions And then distributed. {53.238}

source: མི་ཡི་རྒྱལ་པོ་དཔུང་ཆེན་ལྡན། །མ་ག་དྷཱ་ཡི་མ་སྐྱེས་དགྲ། །རྫུ་འཕྲུལ་ཆེ་ལྡན་ཉན་ཐོས་ནི། །ཀུན་ལའང་གསོལ་བ་རབ་འདེབས་པ། །
en: “At that time, the Magadhan king Ajātaśatru, Together with his great army, Will make a request to all the śrāvakas Endowed with great magical powers: {53.239}

source: བསོད་ནམས་བདག་གིས་མ་བྱས་པས། །བདག་གི་ཕ་ཡང་ཤི་བར་གྱུར། །བདག་ནི་སྡུག་བསྔལ་ལྟུང་གྱུར་པས། །བདག་ཉིད་ཆེན་པོས་དྲང་དུ་གསོལ། །
en: “ ‘Please, great beings, Uplift me also, Crestfallen and suffering, Even though I am a patricide without merit.’ {53.240}

source: དེ་ནས་བློ་ལྡན་ཉན་ཐོས་མཆོག །སངས་རྒྱས་ཐུགས་ལས་སྐྱེས་པའི་སྲས། །འོད་སྲུང་ཆེན་པོ་ཞེས་གྲགས་པ། །སྐྱེ་དགུ་རྣམས་ལ་ཕན་བྱེད་པས། །
en: “The most eminent, wise śrāvaka, The dear son of the Buddha Called Mahākāśyapa, Who brings benefit to beings, {53.241}

source: མ་སྐྱེས་དགྲ་ནི་ངོ་ཚ་ལྡན། །སེམས་ཞུམ་གྱུར་ཏེ་མཐོང་ནས་ནི། །རྫུ་འཕྲུལ་ཉིད་ལ་རབ་གནས་ནས། །དེ་ཡི་དུས་སུ་ཡང་དག་དགོངས། །
en: “Seeing this intelligent man called Ajātaśatru And noticing his distress, Will give him then his due attention And bless him with his magical power. {53.242}

source: རྒྱལ་བའི་རིང་བསྲེལ་སྐུ་གདུང་ནི། །ཆ་གཅིག་ཁྱོད་ཀྱིས་བླང་བར་གྱིས། །རྒྱལ་པོ་གཞན་ནི་སྟོབས་ལྡན་གྱིས། །གཞན་དག་རབ་ཏུ་ཁྱེར་བར་གྱུར། །
en: “He will pick up a portion of relics Produced from the body of the Victorious One. The remaining relics will be taken by the others, Including very powerful snake-like beings. {53.243}

source: ཕན་ཚུན་བབ་ཅོལ་འཁྲུགས་ནས་ནི། །གཅིག་ལ་གཅིག་ནི་འཁོན་བྱས་ནས། །
en: “Each trying to be quicker than the other, They will push and shove in great agitation.

source: དེ་ཚེ་ནམ་མཁར་སྐུ་གདུང་ཁྱེར། །རང་གི་གནས་སུའང་བཞག་པར་འགྱུར། །
en: They will then carry the relics through space To their own abodes and install them there. {53.244}

source: དེ་ཚེ་ཐུབ་པའི་ཉན་ཐོས་མཆོག །དགེ་སློང་འོད་སྲུང་ཆེན་པོ་དེ། །
en: “The monk Mahākāśyapa, The most eminent śrāvaka, Will, at that time, reflect on the Sage: {53.245}

source: ཀྱེ་མའོ་ཀྱི་ཧུད་སེམས་པ་ནི། །ས་སྟེང་འདིར་ནི་རབ་སྟོངས་པ། །སངས་རྒྱས་དང་ནི་རང་རྒྱལ་དང་། །རྫུ་འཕྲུལ་ཆེན་པོའི་ཉན་ཐོས་ཀྱིས། །
en: “ ‘Ah, woe to humankind! He is absent from this earthly round With its buddhas, pratyeka­buddhas, And śrāvakas with great miraculous powers. {53.246}

source: སེམས་ཅན་འཇིགས་པར་སྣང་བ་སྟེ། །སྲིད་པའི་བཙོན་རར་སྤྱོད་པ་ཡིན། །
en: “ ‘The light has gone out for beings Who wander in the prison of saṃsāra.

source: རྣམ་པ་སྣ་ཚོགས་སྡུག་བསྔལ་དྲག །ཡུན་རིང་རྗེས་སུ་མྱོང་བར་འགྱུར། །
en: They will now experience various types Of acute suffering for a long time. {53.247}

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡི། །རིང་བསྲེལ་ཡང་དག་མཆོད་བྱས་ནས། །དེ་དག་ལྷ་ཡི་འཇིག་རྟེན་དུ། །ཡུན་མི་ཐུང་བར་བདེ་བ་མྱོང་། །
en: “ ‘If, however, they worship the relics Of the savior, the lord of the world, They will experience the pleasures Of the god realms in abundance. {53.248}

source: རྒྱལ་སྲིད་དེ་ནས་ལོངས་སྤྱོད་དང་། །རྙེད་པར་དཀའ་བའི་སྔགས་རྣམས་ནི། །
en: “ ‘They will obtain kingdoms, prosperity, And mantric accomplishments, so difficult to attain.

source: འགྲོ་བ་སྣ་ཚོགས་སྤྱོད་པ་ཡིས། །རྣམ་པ་སྣ་ཚོགས་ཐོབ་པར་འགྱུར། །
en: They will attain the various things That reflect the lifestyles of favorable rebirths, {53.249}

source: ཕུན་ཚོགས་འདོད་པ་འཇིག་རྟེན་མཆོག །རྣམ་ཐར་གསུམ་གྱིས་རྣམ་པར་བརྒྱན། །
en: “ ‘Including the desired boon of reaching the peak of existence That is adorned with the threefold liberation.

source: སྐུ་གདུང་རྣམས་ནི་མཆོད་བྱས་ན། །གྲུབ་པ་མཆོག་ནི་ཐོབ་པར་འགྱུར། །
en: By worshiping the relics They will attain the supreme accomplishment.’ {53.250}

source: འཇིག་རྟེན་རྣམས་གྲགས་བྲམ་ཟེ་ཞེས། །ཐུབ་པ་མཆོག་ནི་ཉན་ཐོས་གཙོ། །འོད་སྲུང་ཞེས་ནི་བྱ་བ་ཡིས། །འདི་ལྟར་དེ་ནི་བསམས་ནས་ནི། །དེ་ཚེ་ས་ལས་མ་ཕྱེ་བར། །དེ་ཡི་སྐུ་གདུང་བླངས་ནས་ནི། །
en: “Reflecting like this, The world-renowned brahmin, The śrāvaka and the distinguished sage By the name Kāśyapa, {53.251} “Will pick up some relics And distribute them, at that time, on earth.

source: མ་ག་དྷཱ་བདག་མ་སྐྱེས་དགྲས། །འབད་ནས་ཅུང་ཟད་ཡོངས་སུ་བྱིན། །
en: With special care, he will give a relic-pill To the king of the Magadhans called Ajātaśatru, {53.252}

source: དེ་བཞིན་རྒྱལ་པོ་ཀུན་ལ་ཡང་། །འོད་ཆེན་པོ་ནི་མ་མཐོང་ཡང་། །ཉན་ཐོས་བདག་ཉིད་ཆེན་པོ་དེས། །ཀུན་ལའང་ཐམས་ཅད་རབ་ཏུ་བྱིན། །
en: “And also to all the eight kings. This śrāvaka, a great being Of great splendor, Will give everything completely to all of them. {53.253}

source: ཀུན་ལའང་མི་རྟག་འདུ་ཤེས་ཀྱིས། །དེ་ན་ཡང་ནི་གནས་པར་གྱུར། །སྙིང་རྗེས་བརླན་པའི་སེམས་ཀྱིས་ནི། །སེམས་ཅན་རྣམས་ལ་མྱ་ངན་བྱེད། །
en: “With his mind overcome with compassion, He will grieve for sentient beings Who, lacking the understanding of impermanence, Continue to undergo the cycle of rebirth: {53.254} “ ‘Beings will weep for a long time, Lasting many eons.

source: ཤཱཀྱའི་སྐྱེས་མཆོག་བསྟན་པ་ནི། །འཇིག་རྟེན་དམ་ཆོས་ནུབ་པ་ན། །
en: When the sacred Dharma of the Teacher, the Lion of the Śākyas, Has disappeared in the world,

source: དཔའ་བོ་དེ་ལས་ལངས་ནས་ནི། །སེམས་ཀྱི་སྟོབས་ནི་ཉམས་པ་མེད། །
en: “Then the valiant Mahākāśyapa will rise and, With his mind imbued with power,

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲར་གྱུར་པའི། །མི་ཡི་དབང་པོས་མགྲོན་དུ་བོས། །
en: Will address Ajātaśatru, The king of men: {53.256}

source: སྟོན་པའི་བསྟན་པ་བྱ་བའི་ཕྱིར། །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་འདིར། །
en: “ ‘To honor the Teacher’s instructions, Let us go to the city of Rājagṛha.’

source: འབད་པས་སྐུ་གདུང་མྱུར་དུ་ནི། །གསེར་གྱི་སྣོད་ཀྱི་ནང་དུ་བཅུག །
en: Having carefully placed the relics In one hundred jars, {53.257}

source: དེ་དག་སྔོན་དུ་ཡང་དག་བཏང་། །དེ་ཚེ་རྒྱལ་པོའི་ཁབ་མྱུར་འགྲོ། །
en: “They will then travel eastward, Hastily proceeding toward Rājagṛha.

source: འོད་མའི་ཚལ་དུ་ཕྱིན་ནས་ནི། །སྐུ་གདུང་དག་ནི་ཡང་དག་བཞག །
en: After they arrive in the Bamboo Grove, They will deposit there the relics of the Victorious One. {53.258}

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡི། །མཆོད་རྟེན་རྨད་བྱུང་ཆེན་པོ་བྱས། །
en: “After building a marvelous stūpa Of the savior, the lord of the world,

source: མཆོད་རྟེན་དེ་ནི་མཆོད་བྱེད་པ། །རྣམ་པ་སྣ་ཚོགས་རྒྱན་དང་ནི། །
en: The great king will offer to this stūpa Adornments of many kinds: {53.259}

source: ཕྲེང་བ་གོས་དང་གདུགས་དང་ནི། །དར་ལ་རོལ་མོ་བྱུག་པ་དང་། །རྣམ་པ་སྣ་ཚོགས་དུ་མ་དང་། །མར་མེ་མེ་ཏོག་ཕྲེང་བ་ཡིས། །
en: “Garlands, fabrics, parasols, Scented powders, perfume, incense, Silks, music, riches, banners, Various bells, garlands, unguents, And lamps, chaplets, and wreaths, Of many different kinds. {53.260}

source: ཕྱག་འཚལ་རྗེས་སོང་སེམས་ཀྱིས་ནི། །རྒྱལ་པོ་རབ་ཏུ་མཆོད་པ་བྱེད། །མཆོད་རྟེན་དེ་ལ་མགོས་བཏུད་ནས། །དེ་ཡི་ཚེ་ན་སྨོན་ལམ་བཏབ། །
en: “Having made these offerings, The great king, his mind steeped in reverence, Will bow with his head to the stūpa And at that time make the following aspiration: {53.261}

source: འཇིག་རྟེན་མཆོག་ལ་མཆོད་པ་ཡིས། །བདག་གི་དགེ་བ་མང་པོ་གང་། །དེ་བཞིན་གཤེགས་ལ་མཆོད་པ་འདིས། །བསམ་གྱིས་མི་ཁྱབ་མཆོག་ཐོབ་ཤོག །
en: “ ‘May I, by the abundant merit gained Through worshiping the most eminent being in the world, Attain the inconceivable [state whereby I will] Worship many tathāgatas.’ {53.262}

source: དེ་ནས་རྒྱལ་པོ་ལངས་ནས་ནི། །འོད་སྲུང་ཆེ་ལ་རབ་ཏུ་སྨྲས། །མིག་ནི་མཆི་མས་ཀུན་ཁྱབ་ནས། །
en: “The king will then rise And speak to Mahākāśyapa, Wiping teardrops off his face.

source: མིག་གི་མཆི་མ་ཕྱིས་ནས་ནི། །སྙིང་ནི་བརྩེ་བས་རབ་བརླན་ནས། །དེ་ཚེ་ཕ་ནི་ཡང་དག་དྲན། །
en: With his eyes dimmed by tears And his heart brimming with compassion, He will recall his father: {53.263}

source: ཤེས་རབ་ཆེན་པོ་འཕགས་པ་ཁྱོད། །ཁྱོད་ནི་བདག་གི་དབང་འགྱུར་མཛོད། །
en: “ ‘My noble friend of great wisdom, Please be my confessor!

source: བདག་གི་སྡིག་པ་གང་བྱས་པ། །ངེས་པར་མནར་མེད་རབ་ཏུ་གཞོལ། །
en: The evil that I have committed Will cause me to fall into the Avīci hell. {53.264}

source: སྟོན་པའི་བཀའ་ཡི་ལམ་གནས་པ། །དེ་འདྲའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཡི། །ཕ་ཡི་སྲོག་ལ་གནོད་བཅས་པའི། །མྱ་ངན་བསལ་བར་མི་ནུས་པས། །
en: “ ‘Having killed my father, A Dharma king established On the path taught by the Teacher, I am unable to distract myself.

source: འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱིས། །བདག་ལ་ཆོས་དོན་བསྟན་པར་རིགས། །
en: My good and noble friend, Be so kind as to teach me the meaning of the Dharma!’ {53.265}

source: དེ་སྐད་སྨྲས་ནས་བདག་ཉིད་ཆེ། །རྒྱལ་བའི་ཉན་ཐོས་མཆོག་གྱུར་པ། །བློ་ལྡན་འོད་སྲུང་ཞེས་བྱ་བས། །འདི་དག་ཚིག་ནི་རབ་ཏུ་སྨྲས། །
en: “Thus addressed, the great being, The foremost śrāvaka of the Victorious One, The sagacious one called Mahākāśyapa Will say the following: {53.266}

source: རྒྱལ་པོ་ཆེན་པོ་མ་འཇིགས་ཤིག །
en: “ ‘Do not fear, great king!

source: ཁྱོད་ཀྱི་དགེ་བ་མང་དུ་བྱས། །
en: You have accumulated a lot of merit.

source: སྐྱེ་བ་བརྒྱ་ཕྲག་དུ་མར་ཡང་། །ཁྱོད་ལ་གོམས་པ་རབ་ཏུ་ཡོད། །
en: In your former births You have practiced virtue hundreds of times. {53.267}

source: སངས་རྒྱས་འབྱུང་བ་མེད་པ་ན། །རང་རྒྱལ་གཅིག་ནི་ཡང་དག་བྱུང་། །
en: “ ‘Once, when there was no Buddha in the world, There lived a pratyeka­buddha.

source: གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་རུ། །དེ་ཚེ་ཚོང་དཔོན་བུ་ཞིག་བྱུང་། །
en: At that time, in the city of Vārāṇasī, A son was born to a prominent merchant.

source: མི་ཤེས་བྱིས་པ་གཡོ་བ་ཡིས། །དེ་ཚེ་ཤིང་རྟ་ཞོན་ནས་བྱུང་། །
en: In his ignorance and childish frivolity, He went out onto the road. {53.268}
